In [2]:
import pandas as pd

### reading data from csv file

In [3]:


df1 = pd.read_csv('./moviedata/day20data.csv')

print(df1)

print('--'*20)

      brand  laptop  mobile  speaker  headphone     tv  total
0     apple     200     190      0.0         55    0.0    445
1     haier       0       0      5.0          0   20.0     25
2        lg       0      20     40.0         50   40.0    150
3        mi      20       4      1.0          5    2.0     32
4  samsung1      55     150     30.0         45  100.0    380
5  samsung1      55      30      NaN         45  100.0    380
6      sony       0      67     45.0         89    NaN    451
----------------------------------------

### describe method

#### give info about dataframe like count, mean, std, min, max etc

In [5]:
df1.describe()

           laptop      mobile    speaker  headphone          tv       total
count    7.000000    7.000000   6.000000   7.000000    6.000000    7.000000
mean    47.142857   65.857143  20.166667  41.285714   43.666667  266.142857
std     71.755206   75.326907  20.546695  30.521655   45.963754  190.853721
min      0.000000    0.000000   0.000000   0.000000    0.000000   25.000000
25%      0.000000   12.000000   2.000000  25.000000    6.500000   91.000000
50%     20.000000   30.000000  17.500000  45.000000   30.000000  380.000000
75%     55.000000  108.500000  37.500000  52.500000   85.000000  412.500000
max    200.000000  190.000000  45.000000  89.000000  100.000000  451.000000

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   brand      7 non-null      object
 1   laptop     7 non-null      int64
 2   mobile     7 non-null      int64
 3   speaker    6 non-null      float64
 4   headphone  7 non-null      int64
 5   tv         6 non-null      float64
 6   total      7 non-null      int64
dtypes: float64(2), int64(4), object(1)
memory usage: 524.0+ bytes

In [8]:
df1.dtypes

brand         object
laptop         int64
mobile         int64
speaker      float64
headphone      int64
tv           float64
total          int64
dtype: object

In [9]:
df1.shape

(7, 7)

In [10]:
df1['brand']

0       apple
1       haier
2          lg
3          mi
4    samsung1
5    samsung1
6        sony
Name: brand, dtype: object

In [12]:
df1['laptop'][2]

np.int64(0)

### printing multi column

In [13]:
df1[['brand','laptop']]

      brand  laptop
0     apple     200
1     haier       0
2        lg       0
3        mi      20
4  samsung1      55
5  samsung1      55
6      sony       0

In [14]:
df1.iloc[1:3]

   brand  laptop  mobile  speaker  headphone    tv  total
1  haier       0       0      5.0          0  20.0     25
2     lg       0      20     40.0         50  40.0    150

In [15]:
df1.iloc[1:6:3]

      brand  laptop  mobile  speaker  headphone     tv  total
1     haier       0       0      5.0          0   20.0     25
4  samsung1      55     150     30.0         45  100.0    380

In [16]:
df1.loc[1]

brand        haier
laptop           0
mobile           0
speaker        5.0
headphone        0
tv            20.0
total           25
Name: 1, dtype: object

In [17]:
dfIndex  = pd.read_csv('./moviedata/day20index.csv', index_col = 'Id')

In [18]:
dfIndex

       brand  laptop  mobile  speaker  headphone     tv  total
Id
d1     apple     200     190      0.0         55    0.0    445
d2     haier       0       0      5.0          0   20.0     25
d3        lg       0      20     40.0         50   40.0    150
d4        mi      20       4      1.0          5    2.0     32
d5  samsung1      55     150     30.0         45  100.0    380
d6  samsung1      55      30      NaN         45  100.0    380
d7      sony       0      67     45.0         89    NaN    451